producing-web-service/src/main/resources/orderrequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://www.springframework.org/schema/web-services">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getOrderRequest>
            <us:id>1</us:id>
        </us:getOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>
